SteveLRojas/mcu_libs/CH559/CH559_TM1622/CH559_TM1622.c
#define NO_XSFR_DEFINE
#include "CH559.H"
#include "CH559_GPIO.h"
#include "CH559_TM1622.h"

UINT16 code tm1622_ascii_tab[128] = 
{
	0x0000,
	0x0000,
	0x0000,
	TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_H | TM1622_SEG_J,
	0x0000,
	0x0000,
	0x0000,
	0x0000,
	0x0000,
	0x0000,
	0x0000,
	0x0000,
	0x0000,
	0x0000,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_E | TM1622_SEG_F,
	0xFFFF,
	TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_H | TM1622_SEG_K,
	TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_J | TM1622_SEG_M,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_H | TM1622_SEG_J | TM1622_SEG_K | TM1622_SEG_M,
	TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_E | TM1622_SEG_F,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_L,
	0x0000,
	TM1622_SEG_D1,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_H | TM1622_SEG_J | TM1622_SEG_K | TM1622_SEG_M,
	TM1622_SEG_K | TM1622_SEG_L | TM1622_SEG_M,
	TM1622_SEG_H | TM1622_SEG_I | TM1622_SEG_J,
	TM1622_SEG_G1 | TM1622_SEG_H | TM1622_SEG_K,
	TM1622_SEG_G2 | TM1622_SEG_J | TM1622_SEG_M,
	TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_H | TM1622_SEG_J | TM1622_SEG_K | TM1622_SEG_M,
	TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_K | TM1622_SEG_M,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_H | TM1622_SEG_J,
	0x0000,
	TM1622_SEG_B | TM1622_SEG_C,
	TM1622_SEG_B | TM1622_SEG_F,
	TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2 | TM1622_SEG_I | TM1622_SEG_L,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2 | TM1622_SEG_I | TM1622_SEG_L,
	TM1622_SEG_A1 | TM1622_SEG_C | TM1622_SEG_D2 | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2 | TM1622_SEG_I | TM1622_SEG_J | TM1622_SEG_K | TM1622_SEG_L,
	TM1622_SEG_A1 | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_H | TM1622_SEG_J | TM1622_SEG_M,
	TM1622_SEG_B,
	TM1622_SEG_J | TM1622_SEG_M,
	TM1622_SEG_H | TM1622_SEG_K,
	TM1622_SEG_G1 | TM1622_SEG_G2 | TM1622_SEG_H | TM1622_SEG_I | TM1622_SEG_J | TM1622_SEG_K | TM1622_SEG_L | TM1622_SEG_M,
	TM1622_SEG_G1 | TM1622_SEG_G2 | TM1622_SEG_I | TM1622_SEG_L,
	TM1622_SEG_D1,
	TM1622_SEG_G1 | TM1622_SEG_G2,
	0x0000,
	TM1622_SEG_J | TM1622_SEG_K,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_J | TM1622_SEG_K,
	TM1622_SEG_B | TM1622_SEG_C,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_C,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_D1 | TM1622_SEG_G1,
	TM1622_SEG_A1 | TM1622_SEG_K,
	TM1622_SEG_J | TM1622_SEG_M,
	TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_H | TM1622_SEG_K,
	TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_G2 | TM1622_SEG_L,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_G1 | TM1622_SEG_L,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_G2 | TM1622_SEG_I | TM1622_SEG_L,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_F,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_I | TM1622_SEG_L,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_G1,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_G1,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_G2,
	TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_I | TM1622_SEG_L,
	TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E,
	TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_J | TM1622_SEG_M,
	TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_F,
	TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_H | TM1622_SEG_J,
	TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_H | TM1622_SEG_M,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_F,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_M,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_B | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2 | TM1622_SEG_M,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_I | TM1622_SEG_L,
	TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_F,
	TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_J | TM1622_SEG_K,
	TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_K | TM1622_SEG_M,
	TM1622_SEG_H | TM1622_SEG_J | TM1622_SEG_K | TM1622_SEG_M,
	TM1622_SEG_H | TM1622_SEG_J | TM1622_SEG_L,
	TM1622_SEG_A1 | TM1622_SEG_A2 | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_J | TM1622_SEG_K,
	TM1622_SEG_A2 | TM1622_SEG_D2 | TM1622_SEG_I | TM1622_SEG_L,
	TM1622_SEG_H | TM1622_SEG_M,
	TM1622_SEG_A1 | TM1622_SEG_D1 | TM1622_SEG_I | TM1622_SEG_L,
	TM1622_SEG_K | TM1622_SEG_M,
	TM1622_SEG_D1 | TM1622_SEG_D2,
	TM1622_SEG_H,
	TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_G1 | TM1622_SEG_L,
	TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_B | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_G1 | TM1622_SEG_K,
	TM1622_SEG_A2 | TM1622_SEG_G1 | TM1622_SEG_G2 | TM1622_SEG_I | TM1622_SEG_L,
	TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_G1 | TM1622_SEG_K | TM1622_SEG_M,
	TM1622_SEG_C | TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_A1 | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_G1 | TM1622_SEG_L,
	TM1622_SEG_A2 | TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_G2,
	TM1622_SEG_E | TM1622_SEG_F | TM1622_SEG_G1 | TM1622_SEG_G2 | TM1622_SEG_M,
	TM1622_SEG_A1 | TM1622_SEG_D2 | TM1622_SEG_I | TM1622_SEG_L,
	TM1622_SEG_C | TM1622_SEG_E | TM1622_SEG_G1 | TM1622_SEG_G2 | TM1622_SEG_L,
	TM1622_SEG_C | TM1622_SEG_E | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_G2 | TM1622_SEG_L | TM1622_SEG_M,
	TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E | TM1622_SEG_G1 | TM1622_SEG_G2 | TM1622_SEG_M,
	TM1622_SEG_E | TM1622_SEG_G1 | TM1622_SEG_G2,
	TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_G2 | TM1622_SEG_M,
	TM1622_SEG_D2 | TM1622_SEG_G1 | TM1622_SEG_G2 | TM1622_SEG_I | TM1622_SEG_L,
	TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_E,
	TM1622_SEG_E | TM1622_SEG_K,
	TM1622_SEG_C | TM1622_SEG_E | TM1622_SEG_K | TM1622_SEG_M,
	TM1622_SEG_G1 | TM1622_SEG_G2 | TM1622_SEG_K | TM1622_SEG_M,
	TM1622_SEG_C | TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_M,
	TM1622_SEG_D1 | TM1622_SEG_G1 | TM1622_SEG_K,
	TM1622_SEG_A2 | TM1622_SEG_D2 | TM1622_SEG_G1 | TM1622_SEG_I | TM1622_SEG_L,
	TM1622_SEG_I | TM1622_SEG_L,
	TM1622_SEG_A1 | TM1622_SEG_D1 | TM1622_SEG_G2 | TM1622_SEG_I | TM1622_SEG_L,
	TM1622_SEG_F | TM1622_SEG_H | TM1622_SEG_J,
	TM1622_SEG_D1 | TM1622_SEG_D2 | TM1622_SEG_K | TM1622_SEG_M
};

UINT16 tm1622_buf[TM1622_NUM_DIGITS];
UINT16 tm1622_dp_buf;

void tm1622_init(void)
{
	UINT8 count;
	
	gpio_set_pin(TM1622_PORT_CS, TM1622_PIN_CS);
	gpio_set_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	gpio_set_pin(TM1622_PORT_DATA, TM1622_PIN_DATA);
	
	tm1622_send_command(TM1622_CMD_SYS_EN);
	tm1622_send_command(TM1622_CMD_RC_32K);
	tm1622_send_command(TM1622_CMD_LCD_ON);
	
	for(count = 0; count < TM1622_NUM_DIGITS; ++count)
	{
		tm1622_buf[count] = TM1622_SEG_G1 | TM1622_SEG_G2;
	}
	tm1622_dp_buf = 0;
	tm1622_update();
}

void tm1622_send_command(UINT8 command)
{
	UINT8 count;
	
	gpio_clear_pin(TM1622_PORT_CS, TM1622_PIN_CS);
	
	gpio_set_pin(TM1622_PORT_DATA, TM1622_PIN_DATA);
	gpio_clear_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	gpio_set_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	
	gpio_clear_pin(TM1622_PORT_DATA, TM1622_PIN_DATA);
	gpio_clear_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	gpio_set_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	gpio_clear_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	gpio_set_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	
	for(count = 0; count < 8; count += 1)
	{
		gpio_write_pin(TM1622_PORT_DATA, TM1622_PIN_DATA, command & 0x80);
		gpio_clear_pin(TM1622_PORT_WR, TM1622_PIN_WR);
		gpio_set_pin(TM1622_PORT_WR, TM1622_PIN_WR);
		command = command << 1;
	}
	
	gpio_clear_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	gpio_set_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	
	gpio_set_pin(TM1622_PORT_CS, TM1622_PIN_CS);
}

void tm1622_send_data(UINT8 addr, UINT8 val)
{
	UINT8 count;
	
	gpio_clear_pin(TM1622_PORT_CS, TM1622_PIN_CS);
	
	gpio_set_pin(TM1622_PORT_DATA, TM1622_PIN_DATA);
	gpio_clear_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	gpio_set_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	
	gpio_clear_pin(TM1622_PORT_DATA, TM1622_PIN_DATA);
	gpio_clear_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	gpio_set_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	
	gpio_set_pin(TM1622_PORT_DATA, TM1622_PIN_DATA);
	gpio_clear_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	gpio_set_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	
	for(count = 0; count < 6; ++count)
	{
		gpio_write_pin(TM1622_PORT_DATA, TM1622_PIN_DATA, addr & 0x20);
		gpio_clear_pin(TM1622_PORT_WR, TM1622_PIN_WR);
		gpio_set_pin(TM1622_PORT_WR, TM1622_PIN_WR);
		addr = addr << 1;
	}
	
	for(count = 0; count < 4; ++count)
	{
		gpio_write_pin(TM1622_PORT_DATA, TM1622_PIN_DATA, val & 0x08);
		gpio_clear_pin(TM1622_PORT_WR, TM1622_PIN_WR);
		gpio_set_pin(TM1622_PORT_WR, TM1622_PIN_WR);
		val = val << 1;
	}
	
	gpio_clear_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	gpio_set_pin(TM1622_PORT_WR, TM1622_PIN_WR);
	
	gpio_set_pin(TM1622_PORT_CS, TM1622_PIN_CS);
}

//HINT: Writes a single ASCII character to the display at the specified index.
// If the character is not '.' the decimal point for the corresponding index is cleared.
void tm1622_write_char(UINT8 idx, char val)
{
	if(val == '.')
	{
		tm1622_digit_off(idx);
		tm1622_dp_on(idx);
	}
	else
	{
		tm1622_dp_off(idx);
		tm1622_buf[idx] = tm1622_ascii_tab[val];
	}
}

//HINT: Writes a null-terminated ASCII string to the display starting at the specified index.
// The string is written from left to right, but digits are indexed from right to left (index 0 is on the right).
// Clears the decimal point at the corresponding index for all characters other than '.'.
void tm1622_write_string(UINT8 idx, char* str)
{
	while(*str)
	{
		if(*str == '.')
		{
			tm1622_digit_off(idx);
			tm1622_dp_on(idx);
		}
		else
		{
			tm1622_dp_off(idx);
			tm1622_buf[idx] = tm1622_ascii_tab[*str];
		}
		
		if(idx == 0)
			return;
		
		str += 1;
		idx -= 1;
	}
}

//HINT: Intended for hexadecimal digits, but can also be used for any lower radix.
// Does not affect decimal points.
void tm1622_set_digit(UINT8 idx, UINT8 val)
{
	if(val <= 9)
	{
		tm1622_buf[idx] = tm1622_ascii_tab[val + '0'];
	}
	else
	{
		tm1622_buf[idx] = tm1622_ascii_tab[val + 'A'];
	}
}

//HINT: Updates the digits and decimal points from the corresponding buffers.
void tm1622_update(void)
{
	UINT8 count;
	UINT16 digit;
	UINT8 addr;

	for(count = 0; count < TM1622_NUM_DIGITS; count += 1)
	{
		digit = tm1622_buf[count];
		addr = count << 2;
		tm1622_send_data(addr, digit & 0x0F);
		tm1622_send_data(addr + 1, (digit >> 4) & 0x0F);
		tm1622_send_data(addr + 2, (digit >> 8) & 0x0F);
		tm1622_send_data(addr + 3, digit >> 12);
	}
	
	digit = tm1622_dp_buf >> 1;
	tm1622_send_data(45, digit & 0x07);
	digit = digit >> 3;
	tm1622_send_data(43, digit & 0x07);
	digit = digit >> 3;
	tm1622_send_data(41, digit);
}
